app/controllers/contatos_controller.rb

INSERT INTO "contatos" ("nome", "email", "telefone", "texto", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "teste"], ["email", "teste"], ["telefone", "teste"], ["texto", "teste"], ["created_at", "2018-09-13 16:36:41.951387"], ["updated_at", "2018-09-13 16:36:41.951387"]]
---
  def create
    @contato = Contato.new contato_params

    respond_to do |format|
      if @contato.save

SELECT  "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_contato
      @contato = Contato.find(params[:id])