app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolios = Portfolio.all